Revit 2027 API
BuiltInFailures.DimensionFailures.SpotElevationMissesReference Property
 Spot Dimension does not lie on its reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SpotElevationMissesReference { get; }
Public Shared ReadOnly Property SpotElevationMissesReference As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SpotElevationMissesReference {
	FailureDefinitionId^ get ();
}
static member SpotElevationMissesReference : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace